{
  "is_decoder": false,
  "bos_token_id": 0,
  "eos_token_id": 0,
  "pad_token_id": null,
  "vocab_size": 50304,
  "max_position_embeddings": 2048,
  "hidden_size": 128,
  "num_hidden_layers": 6,
  "num_attention_heads": 4,
  "intermediate_size": 512,
  "hidden_act": "gelu",
  "attention_dropout": 0.0,
  "hidden_dropout": 0.0,
  "classifier_dropout": 0.1,
  "initializer_range": 0.02,
  "layer_norm_eps": 1e-05,
  "use_cache": true,
  "use_parallel_residual": true,
  "attention_bias": true,
  "rope_parameters": {
    "rope_theta": 10000,
    "partial_rotary_factor": 0.25,
    "rope_type": "default"
  },
  "tie_word_embeddings": false,
  "return_dict": true,
  "output_hidden_states": false,
  "dtype": "float16",
  "chunk_size_feed_forward": 0,
  "is_encoder_decoder": false,
  "architectures": [
    "GPTNeoXForCausalLM"
  ],
  "id2label": {
    "0": "LABEL_0",
    "1": "LABEL_1"
  },
  "label2id": {
    "LABEL_0": 0,
    "LABEL_1": 1
  },
  "problem_type": null,
  "_name_or_path": "EleutherAI/pythia-14m",
  "transformers_version": "5.2.0",
  "model_type": "gpt_neox",
  "output_attentions": false
}